from string import digits

a = input("Введите число от 0 до 99: ")
b = ""

if (len(a) <= 0 or len(a) > 2) or (a[0] not in digits) or (len(a) == 2 and a[1] not in digits):
    print("Число слишком большое или отрицательное. Пожалуйста, введите от 0 до 99:)")
    #Прописали ограничения на числа
else:
    if a[-1] == "0" and len(a) == 1:
        b = "ноль"

    if a[-1] == "1":
        b = "один"

    if a[-1] == "2":
        b = "два"

    if a[-1] == "3":
        b = "три"

    if a[-1] == "4":
        b = "четыре"

    if a[-1] == "5":
        b = "пять"

    if a[-1] == "6":
        b = "шесть"

    if a[-1] == "7":
        b = "семь"

    if a[-1] == "8":
        b = "восемь"

    if a[-1] == "9":
        b = "девять"

    if len(a) == 2:
        if a == "10":
            b = "десять"

        if a == "11":
            b = "одиннадцать"

        if a == "12":
            b = "двенадцать"

        if a == "13":
            b = "тринадцать"

        if a == "14":
            b = "четырнадцать"

        if a == "15":
            b = "пятнадцать"

        if a == "16":
            b = "шестнадцать"

        if a == "17":
            b = "семнадцать"

        if a == "18":
            b = "восемнадцать"

        if a == "19":
            b = "девятнадцать"
            #прописали от 0 до 19

        if a[0] == "2":
            b = "двадцать " + b

        if a[0] == "3":
            b = "тридцать " + b

        if a[0] == "4":
            b = "сорок " + b

        if a[0] == "5":
            b = "пятьдесят " + b

        if a[0] == "6":
            b = "шестьдесят " + b

        if a[0] == "7":
            b = "семьдесят " + b

        if a[0] == "8":
            b = "восемьдесят " + b

        if a[0] == "9":
            b = "девяносто " + b
            # прописали оставшиеся десятки

    print(b)




